2023-9-5/f7c76da9cf-STDY.org
#+INCLUDE: "../../prefix.org"

#+TITLE: 学习设备树格式及其生成使用原理

* 2.2 Devicetree Structure and Conventions
node-name@unit-address
1. The node-name shall start with a lower or uppercase character and should describe the general class of device.
2. The unit-address component of the name is specific to the bus type on which the node sits. It consists of one or more ASCLL characters from the set of characters in below table.
   | Character | Description      |
   |-----------+------------------|
   | 0-9       | digit            |
   | a-z       | lowercase letter |
   | A-Z       | uppercase letter |
   | ,         | comma            |
   | .         | period           |
   | -         | underscore       |
   | +         | plus sign        |
   | -         | dash             |
3. In the case of node-name without an @unit-address the node-name shall be unique from any property names at the same level in the tree.
4. The root node does not have a node-name or unit-address. It is identified by a forward slash(/).
   - /
     - cpus
       - cpu@0
       - cpu@1
     - memory@0
     - uart@fe0010000
     - ethernet@fe002000
     - ethernet@fe003000
5. The nodes with the name cpu are distinguished by their unit-address values of 0 and 1.
6. The nodes with the name ethernet are distinguished by their unit-address values of fe002000 and fe003000.

** Generic Names Recommendation
| adc                  | clock-controller | ethernet | accelerometer | co2-sensor     |
| air-pollution-sensor | compact-flash    | fdc      | atm           | cpu            |
| flash                | cpus             | gpio     | crypto        | disk           |
| gpu                  | bluetooth        | display  | bus           | dma-controller |
| hdmi                 | cache-controller | dsi      | hwlock        | camera         |
| dsp                  | i2c              | can      | eeprom        | i2c-mux        |
| charger              | efuse            | ide      | clock         | endpoint       |
| interrupt-controller | iommu            | nvram    | serial        | isa            |
| sound                | spi              | keyboard | key           | pci            |
| sram-controller      | pcie             | led      | leds          | pmu            |
| usb                  | scsi             | memory   | mmc           | mailbox        |

** Path Names
- A node in the devicetree can be uniquely identified by specifying the full path from the root node, through all descendant nodes, to the desired node.
- The convention for specifying a devicee path is:
  /node-name-1/node-name-2/node-name-N
  - For example, the device path to cpu#1 would be:
    /cpus/cpu@1
  - The path to the root is /.
- Nonstandard property names should specify a unique string prefix, such as a stock ticker symbol, identifying the name of the company or organization that defined the property. Examples:
  fsl,channerl-fifo-len
  ibm,ppc-interrupt-server#s
  linux,network-index

** Peoperty Values
- A property value is an array of zero or more bytes that contain information associated with the property.
| Value                | Description                                       |
|----------------------+---------------------------------------------------|
| <empty>              | Value is empty.                                   |
| <u32>                | A 32-bit integer in big-endian format.            |
| <u64>                | Represents a 64-bit integer in big-endian format. |
| <string>             | Strings are printable and null-terminated.        |
| <prop-encoded-array> | Format is specific to the property.               |
| <phandle>            | A <u32> value.                                    |
| <stringlist>         | A list of <string> values concatenated together.  |

- Example: the 32-bit value 0x11223344 would be represented in memory as:
  | address   | 11 |
  | address+1 | 22 |
  | address+2 | 33 |
  | address+3 | 44 |
   
* Standard Properties
** compatible
  - Value type: <stringlist>
  - Example: compatible = "fsl,mpc8641", "ns16550";
** model
  - Value type: <string>
  - Example: mode = "fsl,MPC8349EMITX";
** phandle
  - Value type: <u32>
  - Description: The phandle property specifies a numerical identifier for a node that is unique within the devicetree. The phandle property value is used by other nodes that need to refer to the node associated with the property.
  - Example:
    #+begin_src json
      pic@10000000 {
	 phandle = <1>;
	 interrupt-controller;
	  reg = <0x10000000 0x100>;
      };

      another-device-node {
	  interrupt-parent = <1>;
      };
    #+end_src
