2023-9-5/f7c76da9cf-STDY.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-05-22 Wed 17:05 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>学习设备树格式及其生成使用原理</title>
<meta name="author" content="Yang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">学习设备树格式及其生成使用原理</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgf1fb1d9">1. 2.2 Devicetree Structure and Conventions</a>
<ul>
<li><a href="#orgf3c81fe">1.1. Generic Names Recommendation</a></li>
<li><a href="#org75cb63d">1.2. Path Names</a></li>
<li><a href="#org2d779d8">1.3. Peoperty Values</a></li>
</ul>
</li>
<li><a href="#org7dafc0b">2. Standard Properties</a>
<ul>
<li><a href="#orgf9326b8">2.1. compatible</a></li>
<li><a href="#org0d6cbaa">2.2. model</a></li>
<li><a href="#orgad8d35e">2.3. phandle</a></li>
<li><a href="#orgdf3037d">2.4. status</a></li>
<li><a href="#orgd64f343">2.5. #address-cells and #size-cells</a></li>
<li><a href="#orgb79e768">2.6. reg</a></li>
<li><a href="#org9d43187">2.7. ranges</a></li>
</ul>
</li>
<li><a href="#org6fdd9c8">3. Properties for interrupt generating devices</a></li>
<li><a href="#orgb458255">4. Base Device Node Types</a>
<ul>
<li><a href="#orgd8227bf">4.1. /memory node</a></li>
</ul>
</li>
<li><a href="#org445bfa1">5. Kernel设备树文档</a></li>
<li><a href="#org43b4cb4">6. Device Population</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf1fb1d9" class="outline-2">
<h2 id="orgf1fb1d9"><span class="section-number-2">1.</span> 2.2 Devicetree Structure and Conventions</h2>
<div class="outline-text-2" id="text-1">
<p>
node-name@unit-address
</p>
<ol class="org-ol">
<li>The node-name shall start with a lower or uppercase character and should describe the general class of device.</li>
<li><p>
The unit-address component of the name is specific to the bus type on which the node sits. It consists of one or more ASCLL characters from the set of characters in below table.
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Character</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">0-9</td>
<td class="org-left">digit</td>
</tr>

<tr>
<td class="org-left">a-z</td>
<td class="org-left">lowercase letter</td>
</tr>

<tr>
<td class="org-left">A-Z</td>
<td class="org-left">uppercase letter</td>
</tr>

<tr>
<td class="org-left">,</td>
<td class="org-left">comma</td>
</tr>

<tr>
<td class="org-left">.</td>
<td class="org-left">period</td>
</tr>

<tr>
<td class="org-left">-</td>
<td class="org-left">underscore</td>
</tr>

<tr>
<td class="org-left">+</td>
<td class="org-left">plus sign</td>
</tr>

<tr>
<td class="org-left">-</td>
<td class="org-left">dash</td>
</tr>
</tbody>
</table></li>
<li>In the case of node-name without an @unit-address the node-name shall be unique from any property names at the same level in the tree.</li>
<li>The root node does not have a node-name or unit-address. It is identified by a forward slash(/).
<ul class="org-ul">
<li>/
<ul class="org-ul">
<li>cpus
<ul class="org-ul">
<li>cpu@0</li>
<li>cpu@1</li>
</ul></li>
<li>memory@0</li>
<li>uart@fe0010000</li>
<li>ethernet@fe002000</li>
<li>ethernet@fe003000</li>
</ul></li>
</ul></li>
<li>The nodes with the name cpu are distinguished by their unit-address values of 0 and 1.</li>
<li>The nodes with the name ethernet are distinguished by their unit-address values of fe002000 and fe003000.</li>
</ol>
</div>

<div id="outline-container-orgf3c81fe" class="outline-3">
<h3 id="orgf3c81fe"><span class="section-number-3">1.1.</span> Generic Names Recommendation</h3>
<div class="outline-text-3" id="text-1-1">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">adc</td>
<td class="org-left">clock-controller</td>
<td class="org-left">ethernet</td>
<td class="org-left">accelerometer</td>
<td class="org-left">co2-sensor</td>
</tr>

<tr>
<td class="org-left">air-pollution-sensor</td>
<td class="org-left">compact-flash</td>
<td class="org-left">fdc</td>
<td class="org-left">atm</td>
<td class="org-left">cpu</td>
</tr>

<tr>
<td class="org-left">flash</td>
<td class="org-left">cpus</td>
<td class="org-left">gpio</td>
<td class="org-left">crypto</td>
<td class="org-left">disk</td>
</tr>

<tr>
<td class="org-left">gpu</td>
<td class="org-left">bluetooth</td>
<td class="org-left">display</td>
<td class="org-left">bus</td>
<td class="org-left">dma-controller</td>
</tr>

<tr>
<td class="org-left">hdmi</td>
<td class="org-left">cache-controller</td>
<td class="org-left">dsi</td>
<td class="org-left">hwlock</td>
<td class="org-left">camera</td>
</tr>

<tr>
<td class="org-left">dsp</td>
<td class="org-left">i2c</td>
<td class="org-left">can</td>
<td class="org-left">eeprom</td>
<td class="org-left">i2c-mux</td>
</tr>

<tr>
<td class="org-left">charger</td>
<td class="org-left">efuse</td>
<td class="org-left">ide</td>
<td class="org-left">clock</td>
<td class="org-left">endpoint</td>
</tr>

<tr>
<td class="org-left">interrupt-controller</td>
<td class="org-left">iommu</td>
<td class="org-left">nvram</td>
<td class="org-left">serial</td>
<td class="org-left">isa</td>
</tr>

<tr>
<td class="org-left">sound</td>
<td class="org-left">spi</td>
<td class="org-left">keyboard</td>
<td class="org-left">key</td>
<td class="org-left">pci</td>
</tr>

<tr>
<td class="org-left">sram-controller</td>
<td class="org-left">pcie</td>
<td class="org-left">led</td>
<td class="org-left">leds</td>
<td class="org-left">pmu</td>
</tr>

<tr>
<td class="org-left">usb</td>
<td class="org-left">scsi</td>
<td class="org-left">memory</td>
<td class="org-left">mmc</td>
<td class="org-left">mailbox</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org75cb63d" class="outline-3">
<h3 id="org75cb63d"><span class="section-number-3">1.2.</span> Path Names</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>A node in the devicetree can be uniquely identified by specifying the full path from the root node, through all descendant nodes, to the desired node.</li>
<li>The convention for specifying a devicee path is:
/node-name-1/node-name-2/node-name-N
<ul class="org-ul">
<li>For example, the device path to cpu#1 would be:
/cpus/cpu@1</li>
<li>The path to the root is /.</li>
</ul></li>
<li>Nonstandard property names should specify a unique string prefix, such as a stock ticker symbol, identifying the name of the company or organization that defined the property. Examples:
fsl,channerl-fifo-len
ibm,ppc-interrupt-server#s
linux,network-index</li>
</ul>
</div>
</div>

<div id="outline-container-org2d779d8" class="outline-3">
<h3 id="org2d779d8"><span class="section-number-3">1.3.</span> Peoperty Values</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>A property value is an array of zero or more bytes that contain information associated with the property.</li>
</ul>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Value</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&lt;empty&gt;</td>
<td class="org-left">Value is empty.</td>
</tr>

<tr>
<td class="org-left">&lt;u32&gt;</td>
<td class="org-left">A 32-bit integer in big-endian format.</td>
</tr>

<tr>
<td class="org-left">&lt;u64&gt;</td>
<td class="org-left">Represents a 64-bit integer in big-endian format.</td>
</tr>

<tr>
<td class="org-left">&lt;string&gt;</td>
<td class="org-left">Strings are printable and null-terminated.</td>
</tr>

<tr>
<td class="org-left">&lt;prop-encoded-array&gt;</td>
<td class="org-left">Format is specific to the property.</td>
</tr>

<tr>
<td class="org-left">&lt;phandle&gt;</td>
<td class="org-left">A &lt;u32&gt; value.</td>
</tr>

<tr>
<td class="org-left">&lt;stringlist&gt;</td>
<td class="org-left">A list of &lt;string&gt; values concatenated together.</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li><p>
Example: the 32-bit value 0x11223344 would be represented in memory as:
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">
</colgroup>
<tbody>
<tr>
<td class="org-left">address</td>
<td class="org-right">11</td>
</tr>

<tr>
<td class="org-left">address+1</td>
<td class="org-right">22</td>
</tr>

<tr>
<td class="org-left">address+2</td>
<td class="org-right">33</td>
</tr>

<tr>
<td class="org-left">address+3</td>
<td class="org-right">44</td>
</tr>
</tbody>
</table></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org7dafc0b" class="outline-2">
<h2 id="org7dafc0b"><span class="section-number-2">2.</span> Standard Properties</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgf9326b8" class="outline-3">
<h3 id="orgf9326b8"><span class="section-number-3">2.1.</span> compatible</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Value type: &lt;stringlist&gt;</li>
<li>Example: compatible = "fsl,mpc8641", "ns16550";</li>
</ul>
</div>
</div>
<div id="outline-container-org0d6cbaa" class="outline-3">
<h3 id="org0d6cbaa"><span class="section-number-3">2.2.</span> model</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Value type: &lt;string&gt;</li>
<li>Example: mode = "fsl,MPC8349EMITX";</li>
</ul>
</div>
</div>
<div id="outline-container-orgad8d35e" class="outline-3">
<h3 id="orgad8d35e"><span class="section-number-3">2.3.</span> phandle</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Value type: &lt;u32&gt;</li>
<li>Description: The phandle property specifies a numerical identifier for a node that is unique within the devicetree. The phandle property value is used by other nodes that need to refer to the node associated with the property.</li>
<li><p>
Example:
</p>
<div class="org-src-container">
<pre class="src src-json">      pic@<span style="font-weight: bold; text-decoration: underline;">10000000</span> {
         phandle = &lt;<span style="font-weight: bold; text-decoration: underline;">1</span>&gt;;
         interrupt-controller;
          reg = &lt;<span style="font-weight: bold; text-decoration: underline;">0</span>x<span style="font-weight: bold; text-decoration: underline;">10000000</span> <span style="font-weight: bold; text-decoration: underline;">0</span>x<span style="font-weight: bold; text-decoration: underline;">100</span>&gt;;
      };

      another-device-node {
          interrupt-parent = &lt;<span style="font-weight: bold; text-decoration: underline;">1</span>&gt;;
      };
</pre>
</div></li>
</ul>
</div>
</div>
