2023-9-5/f7c76da9cf-STDY.org
** status
  - Value type: <string>
  - The status property indicates the operaional status of a device. The lack of a status property should be treated as if the property existed with the value of "okay".
    | Value      | Description                                                   |
    |------------+---------------------------------------------------------------|
    | "okay"     | Device is operational.                                        |
    | "disabled" | Isn't operational. But may becomre operational in the future. |
    | "reserved" | "Device is operational, but should not be used."              |
    | "fail"     | Device is not operational.                                    |
    | "fail-sss" | Device is not operational.                                    |
** #address-cells and #size-cells
  - Propery name: #address-cells, #size-cells
  - Value type: <u32>
  - Description:
    The #address-cells and #size-cells properties may be used in any device node that has children in the devicetree hierarchy and describes how child device nodes should be addressed. The #address-cells property defines the number of <u32> cells used to encode the address field in a child node's reg property. The #size-cells property defines the number of <u32> cells used to encode the size field in a child node's reg property.
    The #address-cells and #size-cells properties are not inherited from ancestors in the devicetree. They shall be explicitly defined.
    A DTSpec-compliant boot program shall supply #address-cells and #size-cells on all nodes that have children. If missing, a client program should assume a default value of 2 for #address-cells, and a value of 1 for #size-cells.
  - Example:
    #+begin_src json
      soc {
	  #address-cells = <1>;
	  #size-cells = <1>;

	  serial@4600 {
	      compatible = "ns16550";
	      reg = <0x4600 0x100>;
	      clock-frequency = <0>;
	      interrupts = <0xA 0x8>;
	      interrupt-parent = <&ipic>;
	  };
      };
    #+end_src
  - In this example, the #address-cells and #size-cells properties of the soc node are both set to 1. This setting specifies that one cell is required to represent an address and one cell is required to represent the size of nodes that are children of this node.
** reg
  - Property name: reg
  - Property value: <prop-encoded-array> encoded as an arbitrary number of (address, length) pairs.
  - Description: The reg property describes the address of the device's resources within the address space defined by its parent bus. Most commonly this means the offsets and lengths of memory-mapped IO register blocks, but may have a diffirent meaning on some bus types. Addresses in the address space defined by the root node are CPU real addresses.
    The value is <prop-encoded-array>, composed of an arbitrary number of pairs of address and length, <address length>. The number of <u32> cells required to specify the address and length are bus-specific and are specified by the #size-cells, the filed in the value of reg shall be omitted.
  - Example:
    reg = <0x3000 0x20 0xFE00 0x100>;
** ranges
  - Value type: <empty> or <prop-encoded-array> encoded as an arbitrary number of(child-bus-address, parent-bus-address, length) triplet.
  - Description: The ranges property provides a means of defining a mapping or translation between the address space of the bus(the child address space) and the address space of the bus node's parent(the parent address space).
    
* Properties for interrupt generating devices
#+begin_src json
  interrupts = <0xA 8>;
#+end_src
an interrupt number: 0xA
level/sense encoding: 8

#+begin_src json
  interrupts-extended = <&pic 0xA 8>, <&gic 0xda>;
#+end_src
This example shows how a device with two interrupt outputs connected to two separate interrupt controllers would descibe the connection using an interrupts-extended property. pic is and interrupt controller with an #interrupt-cells specifier of 2, which gic is an interrupt controller with an #interrupts-cells specifier of 1.

* Base Device Node Types
- All devicetrees shall have a root node and the following nodes shall be present at the root of all devicetrees:
  - One /cpus node
  - At least one /memory node
| Property Name  | Usage | Value Type   | Definition                             |
|----------------+-------+--------------+----------------------------------------|
| #address-cells | R     | <u32>        | 指明root的子节点reg属性中地址的数量    |
| #size-cells    | R     | <u32>        | 指明root的子节点reg属性中size的数量    |
| model          | R     | <string>     | 具体板子:"manufacturer,model-number"   |
| compatible     | R     | <stringlist> | 指明兼容性:"manufacturer,model-number" |
| serial-number  | O     | <string>     | 设备的序列号                           |
| chassis-type   | OR    | <string>     | 系统类型：                             |
Usage legend: R=Required, O=Optional, OR=Optional but Recommended, SD=See Definition.
系统类型：
- "desktop"
- "laptop"
- "convertible"
- "server"
- "tablet"
- "handset"
- "watch"
- "embedded"

#+begin_src json
  aliases {
      serial0 = "/simple-bus@fe000000/serial@11c500";
      ethernet0 = "/simple-bus@fe000000/ethernet@31c000";
  };
#+end_src
