2023-9-5/f7c76da9cf-STDY.html
<div id="outline-container-orgdf3037d" class="outline-3">
<h3 id="orgdf3037d"><span class="section-number-3">2.4.</span> status</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>Value type: &lt;string&gt;</li>
<li><p>
The status property indicates the operaional status of a device. The lack of a status property should be treated as if the property existed with the value of "okay".
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Value</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">"okay"</td>
<td class="org-left">Device is operational.</td>
</tr>

<tr>
<td class="org-left">"disabled"</td>
<td class="org-left">Isn't operational. But may becomre operational in the future.</td>
</tr>

<tr>
<td class="org-left">"reserved"</td>
<td class="org-left">"Device is operational, but should not be used."</td>
</tr>

<tr>
<td class="org-left">"fail"</td>
<td class="org-left">Device is not operational.</td>
</tr>

<tr>
<td class="org-left">"fail-sss"</td>
<td class="org-left">Device is not operational.</td>
</tr>
</tbody>
</table></li>
</ul>
</div>
</div>
<div id="outline-container-orgd64f343" class="outline-3">
<h3 id="orgd64f343"><span class="section-number-3">2.5.</span> #address-cells and #size-cells</h3>
<div class="outline-text-3" id="text-2-5">
<ul class="org-ul">
<li>Propery name: #address-cells, #size-cells</li>
<li>Value type: &lt;u32&gt;</li>
<li>Description:
The #address-cells and #size-cells properties may be used in any device node that has children in the devicetree hierarchy and describes how child device nodes should be addressed. The #address-cells property defines the number of &lt;u32&gt; cells used to encode the address field in a child node's reg property. The #size-cells property defines the number of &lt;u32&gt; cells used to encode the size field in a child node's reg property.
The #address-cells and #size-cells properties are not inherited from ancestors in the devicetree. They shall be explicitly defined.
A DTSpec-compliant boot program shall supply #address-cells and #size-cells on all nodes that have children. If missing, a client program should assume a default value of 2 for #address-cells, and a value of 1 for #size-cells.</li>
<li><p>
Example:
</p>
<div class="org-src-container">
<pre class="src src-json">      soc {
          #address-cells = &lt;<span style="font-weight: bold; text-decoration: underline;">1</span>&gt;;
          #size-cells = &lt;<span style="font-weight: bold; text-decoration: underline;">1</span>&gt;;

          serial@<span style="font-weight: bold; text-decoration: underline;">4600</span> {
              compatible = <span style="font-style: italic;">"ns16550"</span>;
              reg = &lt;<span style="font-weight: bold; text-decoration: underline;">0</span>x<span style="font-weight: bold; text-decoration: underline;">4600</span> <span style="font-weight: bold; text-decoration: underline;">0</span>x<span style="font-weight: bold; text-decoration: underline;">100</span>&gt;;
              clock-frequency = &lt;<span style="font-weight: bold; text-decoration: underline;">0</span>&gt;;
              interrupts = &lt;<span style="font-weight: bold; text-decoration: underline;">0</span>xA <span style="font-weight: bold; text-decoration: underline;">0</span>x<span style="font-weight: bold; text-decoration: underline;">8</span>&gt;;
              interrupt-parent = &lt;&amp;ipic&gt;;
          };
      };
</pre>
</div></li>
<li>In this example, the #address-cells and #size-cells properties of the soc node are both set to 1. This setting specifies that one cell is required to represent an address and one cell is required to represent the size of nodes that are children of this node.</li>
</ul>
</div>
</div>
<div id="outline-container-orgb79e768" class="outline-3">
<h3 id="orgb79e768"><span class="section-number-3">2.6.</span> reg</h3>
<div class="outline-text-3" id="text-2-6">
<ul class="org-ul">
<li>Property name: reg</li>
<li>Property value: &lt;prop-encoded-array&gt; encoded as an arbitrary number of (address, length) pairs.</li>
<li>Description: The reg property describes the address of the device's resources within the address space defined by its parent bus. Most commonly this means the offsets and lengths of memory-mapped IO register blocks, but may have a diffirent meaning on some bus types. Addresses in the address space defined by the root node are CPU real addresses.
The value is &lt;prop-encoded-array&gt;, composed of an arbitrary number of pairs of address and length, &lt;address length&gt;. The number of &lt;u32&gt; cells required to specify the address and length are bus-specific and are specified by the #size-cells, the filed in the value of reg shall be omitted.</li>
<li>Example:
reg = &lt;0x3000 0x20 0xFE00 0x100&gt;;</li>
</ul>
</div>
</div>
<div id="outline-container-org9d43187" class="outline-3">
<h3 id="org9d43187"><span class="section-number-3">2.7.</span> ranges</h3>
<div class="outline-text-3" id="text-2-7">
<ul class="org-ul">
<li>Value type: &lt;empty&gt; or &lt;prop-encoded-array&gt; encoded as an arbitrary number of(child-bus-address, parent-bus-address, length) triplet.</li>
<li>Description: The ranges property provides a means of defining a mapping or translation between the address space of the bus(the child address space) and the address space of the bus node's parent(the parent address space).</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org6fdd9c8" class="outline-2">
<h2 id="org6fdd9c8"><span class="section-number-2">3.</span> Properties for interrupt generating devices</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-json">  interrupts = &lt;<span style="font-weight: bold; text-decoration: underline;">0</span>xA <span style="font-weight: bold; text-decoration: underline;">8</span>&gt;;
</pre>
</div>
<p>
an interrupt number: 0xA
level/sense encoding: 8
</p>

<div class="org-src-container">
<pre class="src src-json">  interrupts-extended = &lt;&amp;pic <span style="font-weight: bold; text-decoration: underline;">0</span>xA <span style="font-weight: bold; text-decoration: underline;">8</span>&gt;, &lt;&amp;gic <span style="font-weight: bold; text-decoration: underline;">0</span>xda&gt;;
</pre>
</div>
<p>
This example shows how a device with two interrupt outputs connected to two separate interrupt controllers would descibe the connection using an interrupts-extended property. pic is and interrupt controller with an #interrupt-cells specifier of 2, which gic is an interrupt controller with an #interrupts-cells specifier of 1.
</p>
</div>
</div>

<div id="outline-container-orgb458255" class="outline-2">
<h2 id="orgb458255"><span class="section-number-2">4.</span> Base Device Node Types</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>All devicetrees shall have a root node and the following nodes shall be present at the root of all devicetrees:
<ul class="org-ul">
<li>One /cpus node</li>
<li>At least one /memory node</li>
</ul></li>
</ul>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Property Name</th>
<th scope="col" class="org-left">Usage</th>
<th scope="col" class="org-left">Value Type</th>
<th scope="col" class="org-left">Definition</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">#address-cells</td>
<td class="org-left">R</td>
<td class="org-left">&lt;u32&gt;</td>
<td class="org-left">指明root的子节点reg属性中地址的数量</td>
</tr>

<tr>
<td class="org-left">#size-cells</td>
<td class="org-left">R</td>
<td class="org-left">&lt;u32&gt;</td>
<td class="org-left">指明root的子节点reg属性中size的数量</td>
</tr>

<tr>
<td class="org-left">model</td>
<td class="org-left">R</td>
<td class="org-left">&lt;string&gt;</td>
<td class="org-left">具体板子:"manufacturer,model-number"</td>
</tr>

<tr>
<td class="org-left">compatible</td>
<td class="org-left">R</td>
<td class="org-left">&lt;stringlist&gt;</td>
<td class="org-left">指明兼容性:"manufacturer,model-number"</td>
</tr>

<tr>
<td class="org-left">serial-number</td>
<td class="org-left">O</td>
<td class="org-left">&lt;string&gt;</td>
<td class="org-left">设备的序列号</td>
</tr>

<tr>
<td class="org-left">chassis-type</td>
<td class="org-left">OR</td>
<td class="org-left">&lt;string&gt;</td>
<td class="org-left">系统类型：</td>
</tr>
</tbody>
</table>
<p>
Usage legend: R=Required, O=Optional, OR=Optional but Recommended, SD=See Definition.
系统类型：
</p>
<ul class="org-ul">
<li>"desktop"</li>
<li>"laptop"</li>
<li>"convertible"</li>
<li>"server"</li>
<li>"tablet"</li>
<li>"handset"</li>
<li>"watch"</li>
<li>"embedded"</li>
</ul>

<div class="org-src-container">
<pre class="src src-json">  aliases {
      serial<span style="font-weight: bold; text-decoration: underline;">0</span> = <span style="font-style: italic;">"/simple-bus@fe000000/serial@11c500"</span>;
      ethernet<span style="font-weight: bold; text-decoration: underline;">0</span> = <span style="font-style: italic;">"/simple-bus@fe000000/ethernet@31c000"</span>;
  };
</pre>
</div>
</div>
