2023-9-5/f7c76da9cf-STDY.org
** /memory node
| Property Name       | Usage | Value Type           | Definition                |
|---------------------+-------+----------------------+---------------------------|
| device_type         | R     | <string>             | 需要填上"memory"          |
| reg                 | R     | <prop-encoded-array> | 任意数量addr & size组成   |
| initial-mapped-area | O     | <prop-encoded-array> | 初始映射区域的addr & size |
| hotplug             | O     | <empty>              | 显式告知OS此内存可被移除  |
1. 如果通过UEFI启动，系统内存映射通过GetMemoryMap()这个UEFI启动时服务获取；OS必须忽略/memory节点；
/memory Example:
- 一个64-bit的Power系统有以下物理内存布局：
  - RAM: start: 0x0, length: 0x80000000(2G)
  - RAM: start: 0x100000000, length: 0x100000000(4G)
  - 假设#address-cells=<2> #size-cells=<2>
#+begin_src dts
  memory@0{
  device_type = "memory";
  reg = <0x00000000 0x00000000 0x00000000 0x80000000
         0x00000001 0x00000000 0x00000001 0x00000000>;
};
#+end_src
或者：
#+begin_src dts
memory@0 {
  device_type = "memory";
  reg = <0x00000000 0x00000000 0x00000000 0x80000000>;
};
memory@100000000 {
  device_type = "memory";
  reg = <0x00000001 0x00000000 0x00000001 0x00000000>;
};
#+end_src

* Kernel设备树文档
2.1 High Level View
    1. DT既是描述硬件的数据结构；DT只是提供了一种解耦合硬件平台和软件驱动的能力；
    2. Linux使用DT有三个主要目的：
       1. 平台认证(platform identification)
       2. 运行时配置(runtime configuration)
       3. 设备填充(device population)
2.2 Platform Identification
    1. Kernel使用DT中的数据信息来辨识指定机器；
2.3 Runtime configuration
#+begin_src dts
  chosen {
  bootargs = "console=ttyS0,115200 loglevel=8";
  initrd-start = <0xc8000000>;
  initrd-end = <0xc8200000>;
};
#+end_src
earlyboot期间，架构启动代码通过不同的helper多次回调of_scan_flat_dt()在页启动前，解析设备树数据。of_scan_flat_dt()代码遍历设备树，使用helpers提取earlyboot启动时所需的信息。比如early_init_dt_scan_chosen()用来解析chosen节点。early_init_dt_scan_root()用来初始化DT地址空间模型。early_init_dt_scan_memory()用来决定可用RAM的size和location。
ARM平台上，setup_machine_fdt()函数用来负责挑选正确的machine_desc之后做早期设备树遍历。
* Device Population
辨识完板子，解析完早期配置数据之后，kernel初始化在normal方式下进行。在其中的某些位置处，unflatten_device_tree()将数据转换成更有效的运行时表达。这在一下位置也会调用：.init_early()/.init_irq()/.init_machine()。
