2023-9-5/f7c76da9cf-STDY.html
<div id="outline-container-orgd8227bf" class="outline-3">
<h3 id="orgd8227bf"><span class="section-number-3">4.1.</span> /memory node</h3>
<div class="outline-text-3" id="text-4-1">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Property Name</th>
<th scope="col" class="org-left">Usage</th>
<th scope="col" class="org-left">Value Type</th>
<th scope="col" class="org-left">Definition</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">device_type</td>
<td class="org-left">R</td>
<td class="org-left">&lt;string&gt;</td>
<td class="org-left">需要填上"memory"</td>
</tr>

<tr>
<td class="org-left">reg</td>
<td class="org-left">R</td>
<td class="org-left">&lt;prop-encoded-array&gt;</td>
<td class="org-left">任意数量addr &amp; size组成</td>
</tr>

<tr>
<td class="org-left">initial-mapped-area</td>
<td class="org-left">O</td>
<td class="org-left">&lt;prop-encoded-array&gt;</td>
<td class="org-left">初始映射区域的addr &amp; size</td>
</tr>

<tr>
<td class="org-left">hotplug</td>
<td class="org-left">O</td>
<td class="org-left">&lt;empty&gt;</td>
<td class="org-left">显式告知OS此内存可被移除</td>
</tr>
</tbody>
</table>
<ol class="org-ol">
<li>如果通过UEFI启动，系统内存映射通过GetMemoryMap()这个UEFI启动时服务获取；OS必须忽略/memory节点；</li>
</ol>
<p>
/memory Example:
</p>
<ul class="org-ul">
<li>一个64-bit的Power系统有以下物理内存布局：
<ul class="org-ul">
<li>RAM: start: 0x0, length: 0x80000000(2G)</li>
<li>RAM: start: 0x100000000, length: 0x100000000(4G)</li>
<li>假设#address-cells=&lt;2&gt; #size-cells=&lt;2&gt;</li>
</ul></li>
</ul>
<div class="org-src-container">
<pre class="src src-dts">  memory@0{
  device_type = "memory";
  reg = &lt;0x00000000 0x00000000 0x00000000 0x80000000
         0x00000001 0x00000000 0x00000001 0x00000000&gt;;
};
</pre>
</div>
<p>
或者：
</p>
<div class="org-src-container">
<pre class="src src-dts">memory@0 {
  device_type = "memory";
  reg = &lt;0x00000000 0x00000000 0x00000000 0x80000000&gt;;
};
memory@100000000 {
  device_type = "memory";
  reg = &lt;0x00000001 0x00000000 0x00000001 0x00000000&gt;;
};
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org445bfa1" class="outline-2">
<h2 id="org445bfa1"><span class="section-number-2">5.</span> Kernel设备树文档</h2>
<div class="outline-text-2" id="text-5">
<p>
2.1 High Level View
</p>
<ol class="org-ol">
<li>DT既是描述硬件的数据结构；DT只是提供了一种解耦合硬件平台和软件驱动的能力；</li>
<li>Linux使用DT有三个主要目的：
<ol class="org-ol">
<li>平台认证(platform identification)</li>
<li>运行时配置(runtime configuration)</li>
<li>设备填充(device population)</li>
</ol></li>
</ol>
<p>
2.2 Platform Identification
</p>
<ol class="org-ol">
<li>Kernel使用DT中的数据信息来辨识指定机器；</li>
</ol>
<p>
2.3 Runtime configuration
</p>
<div class="org-src-container">
<pre class="src src-dts">  chosen {
  bootargs = "console=ttyS0,115200 loglevel=8";
  initrd-start = &lt;0xc8000000&gt;;
  initrd-end = &lt;0xc8200000&gt;;
};
</pre>
</div>
<p>
earlyboot期间，架构启动代码通过不同的helper多次回调of_scan_flat_dt()在页启动前，解析设备树数据。of_scan_flat_dt()代码遍历设备树，使用helpers提取earlyboot启动时所需的信息。比如early_init_dt_scan_chosen()用来解析chosen节点。early_init_dt_scan_root()用来初始化DT地址空间模型。early_init_dt_scan_memory()用来决定可用RAM的size和location。
ARM平台上，setup_machine_fdt()函数用来负责挑选正确的machine_desc之后做早期设备树遍历。
</p>
</div>
</div>
<div id="outline-container-org43b4cb4" class="outline-2">
<h2 id="org43b4cb4"><span class="section-number-2">6.</span> Device Population</h2>
<div class="outline-text-2" id="text-6">
<p>
辨识完板子，解析完早期配置数据之后，kernel初始化在normal方式下进行。在其中的某些位置处，unflatten_device_tree()将数据转换成更有效的运行时表达。这在一下位置也会调用：.init_early()/.init_irq()/.init_machine()。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yang</p>
<p class="date">Created: 2024-05-22 Wed 17:05</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
